--simple chinese
local language_sc = {
	[1] = "本地化失败：",
  	[10] = "初始化游戏....",
	[11] = "服务器版本请求失败，请检查您的网络状态。\n \n<span color=60e334 size=32>点击确定重新尝试连接。</span>",
	[12] = "游戏版本已更新，需要您通过平台重新下载安装游戏，对您造成的不便请见谅。",
	[13] = "服务器下载列表请求失败，请检查您的网络状态。\n \n<span color=60e334 size=32>点击确定重新尝试连接。</span>",
	[14] = "Game Verify,please wait….",
	[15] = "正在获取服务器列表，请稍等。。。",
	[16] = "正在获取更新列表，请稍等。。。",
	[17] = "资源下载失败，请检查您的网络状态。\n \n<span color=60e334 size=32>点击确定重新尝试下载。</span>",
	[18] = "#1/#2 : 当前下载进度（#3%）",
	[19] = "游戏版本已更新，需要关闭游戏后，重新启动游戏，对您造成的不便请见谅。",
	[20] = "紧急维护中，对您造成的不便请见谅。",
	[21] = "版本验证失败",
	[22] = "游戏版本已更新，请重新下载并安装游戏。",
	[23] = "服务器列表请求失败，请检查您的网络状态。\n \n<span color=60e334 size=32>点击确定重新连接。</span>",
	[24] = "下载包解压失败。\n \n<span color=60e334 size=32>点击确定重新下载。</span>",
	[25] = "下载文件创建失败。\n \n<span color=60e334 size=32>点击确定重新下载。</span>",
	[26] = "正在解压，请稍等！！！！",
	[27] = "更新完成准备进入游戏",
}
return language_sc